README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-13 lun. 00:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OSM4IQ</title>
<meta name="author" content="osvarcha" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">OSM4IQ</h1>
<p>
osm4iq singifica "Osvarcha's macros for Iq" que traducido es "Las
macros de osvarcha para IQ" que tiene como objetivo crear UDF's
(Funciones definidas por el Usuario) con <a href="https://www.xlwings.org/">xlwings</a>, una biblioteca que
enlaza python con excel, tanto para hacer macros como UDF's solo para
windows.
</p>

<div id="outline-container-orgfec53b3" class="outline-2">
<h2 id="orgfec53b3"><span class="section-number-2">1.</span> Table de Cotenido&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOC_3_ORG">TOC_3_ORG</span></span></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="#org84c738c">Epilogo</a></li>
<li><a href="#org6b1a007">Instalación</a></li>
<li><a href="#orgd016f52">Macros</a></li>
<li><a href="#org381d362">UDF's</a>
<ul class="org-ul">
<li><a href="#org610a6c1">Funciones demo</a></li>
<li><a href="#orgf3eec9d">Funciones num</a></li>
<li><a href="#org969787f">Complemento IQ</a>
<ul class="org-ul">
<li><a href="#orgbe6020c">Funciones necesarias para IQ</a></li>
<li><a href="#org0ddcd4b">Calculos</a></li>
<li><a href="#org6cc0b1a">Coeficientes de actividad</a></li>
<li><a href="#org09c589d">Coeficientes de Fugacidad en Mezcla</a></li>
<li><a href="#orgc24bf97">Energias de Exceso</a></li>
<li><a href="#orgb1e0ebc">Energia Interna Residual</a></li>
<li><a href="#org5cd31df">Energia  Libre de Gibbs Residual</a></li>
<li><a href="#org7fe5bc4">Entalpía Residual</a></li>
<li><a href="#org417a67c">Entropía Residual</a></li>
<li><a href="#org0cb98e5">Factor de Compresibilidad</a></li>
<li><a href="#orgce78180">Operaciones Unitarias</a></li>
<li><a href="#orgecdb570">Parámetros de EoS</a></li>
<li><a href="#org172f7ea">Presión</a></li>
<li><a href="#org23b681a">Presión de Vapor</a></li>
<li><a href="#org41fb375">Propiedades Fisicoquímicas y de Transporte</a></li>
<li><a href="#orgcae0edc">Psicrometría</a></li>
<li><a href="#orga017c84">Trabajo de Expansión/Comprensión</a></li>
<li><a href="#orga7595d2">Volumen Molar</a></li>
</ul></li>
</ul></li>
<li><a href="#orgb33a171">Archivo final</a></li>
</ul>
</div>
</div>

<div id="outline-container-org84c738c" class="outline-2">
<h2 id="org84c738c"><span class="section-number-2">2.</span> Epilogo</h2>
<div class="outline-text-2" id="text-2">
<p>
La documentación y el codigo esta hecho en <a href="https://orgmode.org">org-mode</a> tanto para
escribir las funciones de python como para autodocumentarlas a medida
que avanzo.
</p>

<blockquote>
<p>
<a href="https://orgmode.org">org-mode</a> es una herramientas fantastica de <a href="https://www.gnu.org/software/emacs/">emacs</a> es mas que un formato
de texto plano, se usa para crar documentos, notebooks, agenda, notas,
listas en fin es hackeable, tanto asi que todo el codigo se hara en
este notebook que sera una autodocumentación.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org6b1a007" class="outline-2">
<h2 id="org6b1a007"><span class="section-number-2">3.</span> <span class="todo TODO">TODO</span> Instalación</h2>
<div class="outline-text-2" id="text-3">
<p>
se puede esar miniconda tanto como anaconda, pero este complemento lo
hice con miniconda porque lo considero mas liviano aunque anaconda
incluye toda la paqueteria completa para el analisis de datos.
</p>

<ol class="org-ol">
<li>Descargar una distribución de que incluya conda.
Puede elegir <a href="https://docs.conda.io/en/latest/miniconda.html">miniconda</a> o tambien la distribución completa de
<a href="https://www.anaconda.com/products/distribution">anaconda</a></li>
<li>Clone este repositorio</li>
<li><p>
Crear el entorno conda
En el repositorio hay un archivo <code>environment.yml</code> lo cual creara
el entorno con sus dependencias.
</p>
<div class="org-src-container">
<pre class="src src-powershell">conda env create -f environment.yml
</pre>
</div></li>
<li>Añadir el complento a excel
Abrir el excel, añadir el complemento <code>osm4iq.yml</code> y probarlo.</li>
</ol>
</div>
</div>

<div id="outline-container-orgd016f52" class="outline-2">
<h2 id="orgd016f52"><span class="section-number-2">4.</span> Macros</h2>
<div class="outline-text-2" id="text-4">
<p>
Primero una macro basica que viene con Quickstart de xlwings
</p>
<div class="org-src-container">
<pre class="src src-python">import xlwings as xw

def main():
    wb = xw.Book.caller()
    sheet = wb.sheets[0]
    if sheet["A1"].value == "Hello xlwings!":
        sheet["A1"].value = "Bye xlwings!"
    else:
        sheet["A1"].value = "Hello xlwings!"
</pre>
</div>
</div>
</div>

<div id="outline-container-org381d362" class="outline-2">
<h2 id="org381d362"><span class="section-number-2">5.</span> UDF's</h2>
<div class="outline-text-2" id="text-5">
<p>
Vamos a definir las UDF's
</p>
</div>

<div id="outline-container-org610a6c1" class="outline-3">
<h3 id="org610a6c1"><span class="section-number-3">5.1.</span> Funciones demo</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Son funciones para saludar
</p>
<div class="org-src-container">
<pre class="src src-python">import xlwings as xw

@xw.func
def hello(name):
    return f"Hello {name}!"
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3eec9d" class="outline-3">
<h3 id="orgf3eec9d"><span class="section-number-3">5.2.</span> Funciones num</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Funciones numericas
</p>

<div class="org-src-container">
<pre class="src src-python">import xlwings as xw

@xw.func
def double_sum(x, y):
    """Returns twice the sum of the two arguments"""
    return 2 * (x + y)
</pre>
</div>
</div>
</div>

<div id="outline-container-org969787f" class="outline-3">
<h3 id="org969787f"><span class="section-number-3">5.3.</span> <span class="todo TODO">TODO</span> Complemento IQ</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Este proyecto inicio porque queria reemplazar el complemento de mi
profesor de termodinamica pero sin VBA.
</p>

<blockquote>
<p>
Talvez nunca complete esta lista porque solo utilizare algunas
funciones que utilice en el curso, pero mi objetivo de este
complemento es que sea mas utilice las bondades de python con sus 
paqueterias como añadir <a href="https://www.sympy.org/es/">SymPy</a> para calculo simbolico ejecutados desde
la cinta de opciones, asi como <a href="https://numpy.org/">numpy</a> para calculo matematico, y
algunos complementos se optimizaran con <a href="https://numba.pydata.org_quot">numba</a>.
</p>
</blockquote>
</div>

<div id="outline-container-orgbe6020c" class="outline-4">
<h4 id="orgbe6020c"><span class="section-number-4">5.3.1.</span> <span class="todo TODO">TODO</span> Funciones necesarias para IQ</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
Estas funciones son necesarias para todo IQ pues son ecuaciones matematicas
representadas en funciones.
</p>
</div>

<ol class="org-ol">
<li><a id="org90bd331"></a><span class="todo TODO">TODO</span> Interporlación<br />
<div class="outline-text-5" id="text-5-3-1-1">
<p>
La Interpolación lineal es una tecnica rapida para calculos que son cercanos
especialmente si se usa en tablas porque son datos cercanos y con poco error
experimental. La siguiente ecuación representa representa la función a crear.
</p>

\begin{equation}
f_1\left ( x \right ) = f\left ( x_0 \right ) + \frac{f\left ( x_1 \right ) -
f\left ( x_0 \right )}{x_1 - x_0}\left ( x - x_0 \right )
\end{equation}

<div class="org-src-container">
<pre class="src src-python">def inter_lineal(x, X, Y):
    """Interporlación lineal con dos vectores de datos y el valor a interpolar"""
    pass
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org0ddcd4b" class="outline-4">
<h4 id="org0ddcd4b"><span class="section-number-4">5.3.2.</span> <span class="todo TODO">TODO</span> Calculos</h4>
</div>

<div id="outline-container-org6cc0b1a" class="outline-4">
<h4 id="org6cc0b1a"><span class="section-number-4">5.3.3.</span> <span class="todo TODO">TODO</span> Coeficientes de actividad</h4>
</div>

<div id="outline-container-org09c589d" class="outline-4">
<h4 id="org09c589d"><span class="section-number-4">5.3.4.</span> <span class="todo TODO">TODO</span> Coeficientes de Fugacidad en Mezcla</h4>
</div>

<div id="outline-container-orgc24bf97" class="outline-4">
<h4 id="orgc24bf97"><span class="section-number-4">5.3.5.</span> <span class="todo TODO">TODO</span> Energias de Exceso</h4>
</div>

<div id="outline-container-orgb1e0ebc" class="outline-4">
<h4 id="orgb1e0ebc"><span class="section-number-4">5.3.6.</span> <span class="todo TODO">TODO</span> Energia Interna Residual</h4>
</div>

<div id="outline-container-org5cd31df" class="outline-4">
<h4 id="org5cd31df"><span class="section-number-4">5.3.7.</span> <span class="todo TODO">TODO</span> Energia  Libre de Gibbs Residual</h4>
</div>

<div id="outline-container-org7fe5bc4" class="outline-4">
<h4 id="org7fe5bc4"><span class="section-number-4">5.3.8.</span> <span class="todo TODO">TODO</span> Entalpía Residual</h4>
</div>

<div id="outline-container-org417a67c" class="outline-4">
<h4 id="org417a67c"><span class="section-number-4">5.3.9.</span> <span class="todo TODO">TODO</span> Entropía Residual</h4>
</div>

<div id="outline-container-org0cb98e5" class="outline-4">
<h4 id="org0cb98e5"><span class="section-number-4">5.3.10.</span> <span class="todo TODO">TODO</span> Factor de Compresibilidad</h4>
</div>

<div id="outline-container-orgce78180" class="outline-4">
<h4 id="orgce78180"><span class="section-number-4">5.3.11.</span> <span class="todo TODO">TODO</span> Operaciones Unitarias</h4>
</div>

<div id="outline-container-orgecdb570" class="outline-4">
<h4 id="orgecdb570"><span class="section-number-4">5.3.12.</span> <span class="todo TODO">TODO</span> Parámetros de EoS</h4>
</div>

<div id="outline-container-org172f7ea" class="outline-4">
<h4 id="org172f7ea"><span class="section-number-4">5.3.13.</span> <span class="todo TODO">TODO</span> Presión</h4>
</div>

<div id="outline-container-org23b681a" class="outline-4">
<h4 id="org23b681a"><span class="section-number-4">5.3.14.</span> <span class="todo TODO">TODO</span> Presión de Vapor</h4>
</div>

<div id="outline-container-org41fb375" class="outline-4">
<h4 id="org41fb375"><span class="section-number-4">5.3.15.</span> <span class="todo TODO">TODO</span> Propiedades Fisicoquímicas y de Transporte</h4>
</div>

<div id="outline-container-orgcae0edc" class="outline-4">
<h4 id="orgcae0edc"><span class="section-number-4">5.3.16.</span> <span class="todo TODO">TODO</span> Psicrometría</h4>
</div>

<div id="outline-container-orga017c84" class="outline-4">
<h4 id="orga017c84"><span class="section-number-4">5.3.17.</span> <span class="todo TODO">TODO</span> Trabajo de Expansión/Comprensión</h4>
</div>

<div id="outline-container-orga7595d2" class="outline-4">
<h4 id="orga7595d2"><span class="section-number-4">5.3.18.</span> <span class="todo TODO">TODO</span> Volumen Molar</h4>
</div>
</div>
</div>

<div id="outline-container-orgb33a171" class="outline-2">
<h2 id="orgb33a171"><span class="section-number-2">6.</span> Archivo final</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-python">import xlwings as xw

# Funciones a importar
from package.macros.main import main
from package.funciones.demo import hello, hola_mundo
from package.funciones.num import double_sum

if __name__ == "__main__":
    xw.Book("osm4iq.xlsm").set_mock_caller()
    main()
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: osvarcha</p>
<p class="date">Created: 2023-03-13 lun. 00:04</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>